Public Attributes | List of all members
API_ComponentID Struct Reference
Element Manager
Identifies a component. More...
#include <APIdefs_Component.h>
 Public Attributes
 API_Guid  | componentGuid
Guid of the component.
Detailed Description
Identifies a component.
Remarks
Use API_ElemComponentID to identify a component of an element.